trans.addDict([
    [300, 0, "description"], [300, 1, "описание"],
    [301, 0, "time"], [301, 1, "время"],
    [302, 0, "value"], [302, 1, "значение"],
    [303, 0, "download"], [303, 1, "скачать"],
    [304, 0, "update"], [304, 1, "обновить"],
    [305, 0, "select"], [305, 1, "выбрать"],
    [306, 0, "status"], [306, 1, "состояние"],
    [307, 0, "logger"], [307, 1, "регистратор"],
    [308, 0, "settings"], [308, 1, "настройки"],
    [309, 0, "interval"], [309, 1, "интервал"],
    [310, 0, "quantity"], [310, 1, "количество"],
    [311, 0, "help"], [311, 1, "помощь"],
    [312, 0, "start"], [312, 1, "старт"],
    [313, 0, "stop"], [313, 1, "стоп"],
    [314, 0, "active"], [314, 1, "работает"],
    [315, 0, "controller state"], [315, 1, "состояние контроллера"]
            //[310, 0, ""], [310, 1, ""],
            //[310, 0, ""], [310, 1, ""],
            //[310, 0, ""], [310, 1, ""],
            //[310, 0, ""], [310, 1, ""],

]);
//menu
trans.addDict([
    [401, 0, "log"], [401, 1, "журнал"],
    [402, 0, "help"], [402, 1, "помощь"]
]);

//error
trans.addDict([
    [250, 0, "failed to get data from database"], [250, 1, "не удалось получить данные из базы дынных"],
    [251, 0, "failed to send command to controller"], [251, 1, "не удалось отправить команду контроллеру"],
    [252, 0, "controller is active and ready for valve control"], [252, 1, "контроллер активен и готов к выполнению команд на управление клапанами"],
    [253, 0, "controller is at standby mode and not ready for valve control"], [253, 1, "контроллер находится в режиме ожидания и не готов управлять клапанами"],
    [254, 0, "failed to get response from controller"], [254, 1, "не удалось получить ответ от контроллера"],
    [255, 0, "unknown response from controller"], [255, 1, "неизвестный ответ от контроллера"],
    [256, 0, "broken connection with one of modules"], [256, 1, "нет связи с одним из модулей"],
    [257, 0, "failed to save"], [257, 1, "не удалось сохранить"]
]);




